Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: Unicode provides many different character properties. The most often needed ones are available through these macros which are mapped to C functions depending on the Python configuration.
pl: Unikod dostarcza wiele różnych właściwości znaków. Najczęściej potrzebne są dostępne przez te makropolecenia które są zmapowane na zadania w języku C zależnie od konfiguracji języka pytonowskiego.

source: These APIs can be used for fast direct character conversions:
pl: Te sprzęgi mogą być używane do szybkich zamian znaków:

source: Plain Py_UNICODE
pl: Czysty Py_UNICODE

source: To create Unicode objects and access their basic sequence properties, use these APIs:
pl: Aby tworzyć przedmioty unikodowe i korzystać z ich podstawowych właściwości sekwencyjnych, używaj tych sprzęgów - z ang. - API:

source: If the platform supports :ctype:`wchar_t` and provides a header file wchar.h, Python can interface directly to this type using the following functions. Support is optimized if Python's own :ctype:`Py_UNICODE` type is identical to the system's :ctype:`wchar_t`.
pl: Jeśli urządzenie fizyczne wspiera :ctype:`wchar_t` i dostarcza plik nagłówkowy wchar.h, język pytonowski może odnosić się do tego typu bezpośrednio przy użyciu następujących zadań. Wsparcie jest zoptymalizowane jeśli typ własny języku pytonowskiego :ctype:`Py_UNICODE` jest identyczny z systemowym :ctype:`wchar_t`.

source: File System Encoding
pl: Kodowanie systemu plików

source: To encode and decode file names and other environment strings, :cdata:`Py_FileSystemEncoding` should be used as the encoding, and ``"surrogateescape"`` should be used as the error handler (:pep:`383`). To encode file names during argument parsing, the ``"O&"`` converter should be used, passsing :func:PyUnicode_FSConverter as the conversion function:
pl: Aby zakodować i odkodować nazwy plików inne napisy środowiskowe, :cdata:`Py_FileSystemEncoding` powinien być używany jako kodowanie i ``"surrogateescape"`` powinien być używany do obsługi błędów (zob. :pep:`383`). Aby zakodować nazwy plików w czasie przetwarzania parametrów, powinno się użyć konwertera ``"O&"`` przekazując :func:`PyUnicode_FSConverter` jako zadanie konwersji:

source: wchar_t Support
pl: Wsparcie dla wchar_t

source: wchar_t support for platforms which support it:
pl: Wsparcie dla wchar_t dla maszyn które je wspierają:

source: Built-in Codecs
pl: Wbudowane kodery/dekodery

source: Python provides a set of built-in codecs which are written in C for speed. All of these codecs are directly usable via the following functions.
pl: Język pytonowski zapewnia zestaw wbudowanych koderów/dekoderów, które są napisane w języku C dla szybkości. Wszystkie te kodery/dekodery są bezpośrednio użyteczne przez następujące zadania.

source: Many of the following APIs take two arguments encoding and errors. These parameters encoding and errors have the same semantics as the ones of the built-in :func:`unicode` Unicode object constructor.
pl: Wiele z następujących sprzęgów pobiera dwa parametry kodowania i błędów. Te parametry kodowania i błędów mają tę samą składnię, co te dla wbudowanego konstruktora przedmiotu Unikodu - :func:`unicode`.

source: Setting encoding to *NULL* causes the default encoding to be used which is ASCII. The file system calls should use :cfunc:`PyUnicode_FSConverter` for encoding file names. This uses the variable :cdata:`Py_FileSystemDefaultEncoding` internally. This variable should be treated as read-only: On some systems, it will be a pointer to a static string, on others, it will change at run-time (such as when the application invokes setlocale).
pl: Ustawienie kodowania na puste - z ang. - *NULL* powoduje użycie domyślnego kodowania którym jest ASCII. Odwołania systemu plików powinny używać :cfunc:`PyUnicode_FSConverter` dla kodowania nazw plików. To używa zmiennej :cdata:`Py_FileSystemDefaultEncoding wewnętrznie. Ta zmienna powinna być traktowana jak tylko-do-odczytu: Na niektórych maszynach, będzie ona wskaźnikiem do statycznego ciągu znaków, na innych będzie ulegać zmianie w czasie-wykonania-programu (ta, jak wtedy, gdy program wywołuje setlocale).

source: Error handling is set by errors which may also be set to *NULL* meaning to use the default handling defined for the codec. Default error handling for all built-in codecs is "strict" (:exc:`ValueError` is raised).
pl: Obsługa błędów jest ustawiana przez błędy które mogą także być ustawione na *NULL* co oznacza użycie domyślnego sposobu obsługi określonego dla kodera/dekodera. Domyślna obsługa błędów dla wszystkich wbudowanych koderów/dekoderów jest "ścisła" (podnoszony jest :exc:`ValueError`).

source: The codecs all use a similar interface. Only deviation from the following generic ones are documented for simplicity.
pl: Kodery/dekodery wszystkie używają podobnego sprzęgu. Jedyne odstępstwa od następujących podstawowych są opisane dla uproszczenia.

source: Generic Codecs
pl: Kodery/dekodery podstawowe

source: These are the generic codec APIs:
pl: To są podstawowe sprzęgi koderów/dekoderów (z ang. - API):

source: UTF-8 Codecs
pl: Kodery/dekodery UTF-8

source: These are the UTF-8 codec APIs:
pl: To są sprzęgi kodera/dekodera UTF-8 (z ang. - API):

source: UTF-32 Codecs
pl: Kodery/dekodery UTF-32

source: These are the UTF-32 codec APIs:
pl: To są sprzęgi kodera/dekodera UTF-32 (z ang. - API):

source: UTF-16 Codecs
pl: Kodery/dekodery UTF-16

source: These are the UTF-16 codec APIs:
pl: To są sprzęgi kodera/dekodera UTF-16 (z ang. - API):

source: Unicode-Escape Codecs
pl: Kodery/Dekodery ucieczkowych-sekwencji-Unikodu

source: These are the "Unicode Escape" codec APIs:
pl: To są sprzęgi kodera/dekodera ucieczkowych-sekwencji-Unikodu (z ang. - API):

source: Raw-Unicode-Escape Codecs
pl: Kodery/dekodery surowych-sekwencji-ucieczkowych-Unikodu

source: These are the "Raw Unicode Escape" codec APIs:
pl: To są sprzęgi kodera/dekodera "surowych sekwencji ucieczkowych Unikodu" (z ang. - API):

source: Latin-1 Codecs
pl: Kodery/dekodery Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
pl: To są sprzęgi kodera/dekodera Latin-1 (z ang. API): Latin-1 odpowiada pierwszym 256 znakom porządkowym Unikodu i tylko te są akceptowane przez kodery/dekodery podczas kodowania.

source: ASCII Codecs
pl: Kodery/dekodery ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
pl: To są sprzegi koderów/dekoderów ASCII (z ang. API). Tylko 7-bitowe dane ASCII są akceptowane. Wszystkie inne kody generują błędy.

source: Character Map Codecs
pl: Kodery/Dekodery Mapy Znaków

source: These are the mapping codec APIs:
pl: To są sprzęgi kodera/dekodera mapowania (z ang. API):

source: This codec is special in that it can be used to implement many different codecs (and this is in fact what was done to obtain most of the standard codecs included in the :mod:`encodings` package). The codec uses mapping to encode and decode characters.
pl: Ten koder/dekoder jest szczególny w tym że może być użyty do wypełnienia wielu różnych kederów/dekoderów (i to jest faktycznie to co uczyniono aby otrzymać większość ze standardowych koderów/dekoderów załączonych w pakiecie :mod:`encodings`). Koder/dekoder używa mapowania do zakodowania i zdekodowania znaków.

source: Decoding mappings must map single string characters to single Unicode characters, integers (which are then interpreted as Unicode ordinals) or None (meaning "undefined mapping" and causing an error).
pl: Mapowania dekodujące muszą mapować pojedynczy ciąg znaków na pojedyncze znaki Unikodu, liczby całkowite (które są potem interpretowane jako liczby porządkowe Unikodu) lub Nic (z ang. - None) (oznaczające "niezdefiniowane mapowanie" i powodujące błąd).

source: Encoding mappings must map single Unicode characters to single string characters, integers (which are then interpreted as Latin-1 ordinals) or None (meaning "undefined mapping" and causing an error).
pl: Mapowania kodujące muszą mapować pojedyncze znaki Unikodu na pojedyncze ciągi znaków, liczby całkowite (które są potem interpretowane jako liczby porządkowe Latin-1) lub Nic ( z ang. None) (oznaczające "niezdefiniowane mapowanie" i powodujące błąd).

source: The mapping objects provided must only support the __getitem__ mapping interface.
pl: Przedmioty mapujące dostarczane muszą tylko wspierać mapujący sprzęg __getitem__.

source: If a character lookup fails with a LookupError, the character is copied as-is meaning that its ordinal value will be interpreted as Unicode or Latin-1 ordinal resp. Because of this, mappings only need to contain those mappings which map characters to different code points.
pl: Jeśli podgląd znaku zawiedzie z błędem podglądu z ang. - LookupError, znak jest kopiowany taki jaki jest to znaczy że jego wartość porządkowa zostanie zinterpretowana jako Unikod lub liczba porządkowa Latin-1 odpowiednio. Z tego powodu zbiór mapowań wymaga zawarcia w nim tylko tych mapowań, które mapują znaki do różnych punktów kodowania.

source: The following codec API is special in that maps Unicode to Unicode.
pl: Następujący sprzęg kodera/dekodera (z ang. - API) jest szczególny gdyż mapuje Unikod na Unikod.

source: These are the MBCS codec APIs. They are currently only available on Windows and use the Win32 MBCS converters to implement the conversions. Note that MBCS (or DBCS) is a class of encodings, not just one. The target encoding is defined by the user settings on the machine running the codec.
pl: To są sprzęgi kodera/dekodera MBCS Obecnie dostępne są one tylko na Windows i używają konwerterów MBCS Win32 aby wypełnić konwersje. Zauważ, że MBCS (lub DBCS) jest kategorią kodowań, nie tylko jednym z nich. Docelowe kodowanie jest zdefiniowane przez ustawienia użytkownik na maszynie uruchamiającej koder/dekoder.

source: MBCS codecs for Windows
pl: Kodery/dekodery MBCS w Windows

source: Methods & Slots
pl: Sposoby postępowania i Gniazda

source: Methods and Slot Functions
pl: Sposoby postępowania i Zadania Gniazd

source: The following APIs are capable of handling Unicode objects and strings on input (we refer to them as strings in the descriptions) and return Unicode objects or integers as appropriate.
pl: Następujące sprzęgi (z ang. - API) są przydatne w posługiwaniu się przedmiotami Unikodu i ciągów znaków na wejściu (odwołujemy się do nich jako do ciągów w opisach) i zwracają przedmioty Unikodu lub liczby całkowite jako właściwe.

source: They all return *NULL* or ``-1`` if an exception occurs.
pl: Wszystkie one zwracają *PUSTY* ( - z ang. - *NULL* ) lub ``-1`` jeśli nastąpi sytuacja wyjątkowa.

source: Utilities
pl: Użytki

source: The functions in this chapter perform various utility tasks, ranging from helping C code be more portable across platforms, using Python modules from C, and parsing function arguments and constructing Python values from C values.
pl: Zadania w tym rozdziale wykonują różne działania użytkowe, poczynając od pomagania kodowi C aby był bardziej przenośny pomiędzy maszynami, poprzez używanie modułów języka pytonowskiego z poziomu C, i przetwarzając parametry zadań i konstruując wartości języka pytonowskiego z wartości C.

source: The Very High Level Layer
pl: Warstwa Bardzo Wysokiego Poziomu

source: The functions in this chapter will let you execute Python source code given in a file or a buffer, but they will not let you interact in a more detailed way with the interpreter.
pl: Zadania w tym rozdziale będą pozwalały Ci wykonywać kod w języku pytonowskim podany w pliku lub przestrzeni wymiany, ale nie pozwolą Ci współpracować w szczególny sposób z programem interpretującym polecenia języka pytonowskiego.

source: Several of these functions accept a start symbol from the grammar as a parameter. The available start symbols are :const:`Py_eval_input`, :const:`Py_file_input`, and :const:`Py_single_input`. These are described following the functions which accept them as parameters.
pl: Kilka z tych zadań akceptuje symbol startowy z gramatyki jako parametr. Dostępnymi symbolami startowymi są :const:`Py_eval_input`, :const:`Py_file_input` i :const:`Py_single_input`. Są one opisane po zadaniach akceptujących je jako parametry.

source: Note also that several of these functions take :ctype:`FILE\*` parameters. One particular issue which needs to be handled carefully is that the :ctype:`FILE` structure for different C libraries can be different and incompatible. Under Windows (at least), it is possible for dynamically linked extensions to actually use different libraries, so care should be taken that :ctype:`FILE\*` parameters are only passed to these functions if it is certain that they were created by the same library that the Python runtime is using.
pl: Zwróć także uwagę że kilka z tych zadań przyjmuje pliki - :ctype:`FILE\*` jako paramtery. Jedną szczególną sprawą którą trzeba traktować uważnie jest to, że struktura :ctype:`FILE` dla różnych bibliotek C może być różna i niezgodna. Pod Windows (przynajmniej) możliwe jest dla dynamicznie łączonych rozszerzeń użycie różnych bibliotek, więc powinno się zwrócić uwagę, aby parametry :ctype:`FILE\*` były przekazywane do tych zadań tylko gdy jest pewne że zostały utworzone przez tą samą bibliotekę której używa aktualnie wykonywany program interpretujący polecenia języka pytonowskiego.

source: Weak Reference Objects
pl: Przedmioty Słabych Odniesień

source: Python supports *weak references* as first-class objects. There are two specific object types which directly implement weak references. The first is a simple reference object, and the second acts as a proxy for the original object as much as it can.
pl: Język pytonowskie wspiera *słabe odniesienia* jako przedmioty pierwszej-klasy. Istnieją dwa szczególne rodzaje przedmiotów które bezpośrednio wypełniają słabe odniesienia. Pierwszym jest prosty przedmiot odniesienia, a drugi działa jako przedmiot zastępczy dla pierwotnego przedmiotu na tyle na ile się da.
